app/views/gossip/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
    <p class="potin">Potin n° <%= @id%></p>
    <div> <em>Auteur</em> : <%= @gossip.user.first_name %> <%= @gossip.user.last_name %></div>