app/controllers/gossip_controller.rb

  def show
    @id = (params[:gossip_id]).to_i
    @gossip = Gossip.find_by(id: @id)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]