app/controllers/homepage_controller.rb

SELECT "gossips".* FROM "gossips"
---
  def show
    @gossips = Gossip.all