app/controllers/user_controller.rb

  def show
    @id = (params[:user_id]).to_i
    @user = User.find_by(id: @id)
    @user_gossips = Gossip.where(user_id: @id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 25]]